52n-ses-core/src/main/config/updateIntervalExample.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope">
	<env:Header>
		<wsa:To xmlns:wsa="http://www.w3.org/2005/08/addressing">http://v-tml.uni-muenster.de:8080/EventService/services/Broker
		</wsa:To>
		<wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">http://docs.oasis-open.org/wsn/bw-2/NotificationProducer/SubscribeRequest
		</wsa:Action>
		<wsa:MessageID xmlns:wsa="http://www.w3.org/2005/08/addressing">uuid:1b4d3025-f80a-a5b6-aa37-864c47fa1a7e
		</wsa:MessageID>
		<wsa:From xmlns:wsa="http://www.w3.org/2005/08/addressing">
			<wsa:Address>http://www.w3.org/2005/08/addressing/role/anonymous
			</wsa:Address>
		</wsa:From>
	</env:Header>
	<env:Body>
		<wsnt:Subscribe xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2">
			<wsnt:ConsumerReference>
				<wsa:Address xmlns:wsa="http://www.w3.org/2005/08/addressing">http://a.wsn.consumer:8082/
				</wsa:Address>
			</wsnt:ConsumerReference>
			<wsnt:Filter>
				<wsnt:MessageContent Dialect="http://www.opengis.net/ses/filter/level2">
					<fes:Filter	xmlns:fes="http://www.opengis.net/fes/2.0" xmlns:gml="http://www.opengis.net/gml/3.2">
						<fes:Within>
							<fes:ValueReference>input/geometry</fes:ValueReference>
							<fes:Literal>
								<gml:Polygon gml:id="aoi_01">
									<gml:exterior>
										<gml:LinearRing>
											<gml:posList>58.0 3.0 40.0 3.0 40.0 -1.0 58.0 -1.0
											</gml:posList>
										</gml:LinearRing>
									</gml:exterior>
								</gml:Polygon>
							</fes:Literal>
						</fes:Within>
					</fes:Filter>
				</wsnt:MessageContent>
			</wsnt:Filter>
			
			<!-- UPDATE INTERVAL PART -->
			<wsnt:SubscriptionPolicy>
				<essp:EventServiceSubscriptionPolicy xmlns:essp="http://www.opengis.net/es-sp/0.0">
					<essp:UpdateInterval>
						<essp:IntervalDuration>PT10M</essp:IntervalDuration>
						<essp:DisseminationMethod>batching</essp:DisseminationMethod>
						<essp:NonRelatedEventTreatment>ignore</essp:NonRelatedEventTreatment>
					</essp:UpdateInterval>
				</essp:EventServiceSubscriptionPolicy>
			</wsnt:SubscriptionPolicy>
			<!-- END: UPDATE INTERVAL PART -->
			
		</wsnt:Subscribe>
	</env:Body>
</env:Envelope>